Joined solid geometry cannot be copied as a whole. Instead, select the individual extrusions, etc., using Pick box or Ctrl-select and copy them.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId CannotCopyJoinedGeometry { get; }
  Visual Basic
Public Shared ReadOnly Property CannotCopyJoinedGeometry As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ CannotCopyJoinedGeometry {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures CopyPasteFailures Class
  Autodesk.Revit.DB Namespace